import React from "react";
import OfferCard from "./OfferCard";
import { IOffer } from "../Home/OffersSection";

export default function HallOffers() {
  const offers: IOffer[] = [
    {
      id: 1,
      image: "/images/Frame 18 (1).svg",
      title: "باقة عروض شهر اغسطس",
      hotel_name: "فندق روش ريحان من روتانا",
      description:
        "إنها سلسلة من الكلمات اللاتينية التي ، عند وضعها في موضعها ،لا تشكل جملًا بمعنى كامل ، ولكنها تعطي الحياة لنص اختبار مفيد لملء الفراغات.",

      price: "800 - 600 ر.س",
      options: [
        "500 - 1000 شخص",
        "قاعة الحفل",
        "قاعة عشاء منفصلة",
        " مشرفة خاصة للعروس",
        "قاعة الحفل",
        "خدمات الصبابات و عاملات الضيافة",
        "جناح خاص للعرسان",
      ],
      endDate: "13/7/2024",
    },
    {
      id: 2,
      image: "/images/Frame 18 (1).svg",
      title: "باقة عروض شهر اغسطس",
      hotel_name: "فندق روش ريحان من روتانا",
      description:
        "إنها سلسلة من الكلمات اللاتينية التي ، عند وضعها في موضعها ،لا تشكل جملًا بمعنى كامل ، ولكنها تعطي الحياة لنص اختبار مفيد لملء الفراغات.",

      price: "800 - 600 ر.س",
      options: [
        "500 - 1000 شخص",
        "قاعة الحفل",
        "قاعة عشاء منفصلة",
        " مشرفة خاصة للعروس",
        "قاعة الحفل",
        "خدمات الصبابات و عاملات الضيافة",
        "جناح خاص للعرسان",
      ],
      endDate: "13/7/2024",
    },
    {
      id: 3,
      image: "/images/Frame 18 (1).svg",
      title: "باقة عروض شهر اغسطس",
      hotel_name: "فندق روش ريحان من روتانا",
      description:
        "إنها سلسلة من الكلمات اللاتينية التي ، عند وضعها في موضعها ،لا تشكل جملًا بمعنى كامل ، ولكنها تعطي الحياة لنص اختبار مفيد لملء الفراغات.",
      price: "800 - 600 ر.س",
      options: [
        "500 - 1000 شخص",
        "قاعة الحفل",
        "قاعة عشاء منفصلة",
        " مشرفة خاصة للعروس",
        "قاعة الحفل",
        "خدمات الصبابات و عاملات الضيافة",
        "جناح خاص للعرسان",
      ],
      endDate: "13/7/2024",
    },
  ];

  return (
    <div className="container px-4 flex flex-col gap-5">
      {offers?.map((offer: IOffer) => (
        <OfferCard key={offer.id} offer={offer} />
      ))}
    </div>
  );
}
